{
  "backend/main.mo": "Defines the main canister with access control, user approval, profile management, and idempotent approval request reset logic using Maps and MixinAuthorization.",
  "backend/migration.mo": "Provides a trivial migration that preserves the requestCounter field across upgrades.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Text file containing human-written summaries of all frontend source files for reference.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH color variables for light and dark modes with Android-inspired theming.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component that manages identity and approval state to route users to login, pending, or main app views.",
  "frontend/src/components/AdminGuard.tsx": "Protects admin-only routes by redirecting non-admin users and showing a loading state while verifying access.",
  "frontend/src/hooks/useAccessStatus.ts": "Query hook that fetches approval and admin status for the current identity with refetching on mount and focus.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements the Internet Identity authentication context, handling login, stored identity loading, and logout.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profiles, approval requests, admin approval management, and roles with automatic invalidation.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AccessPendingScreen.tsx": "UI for submitting and tracking access approval requests with localStorage persistence and error handling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface for viewing, approving, rejecting users, and managing roles and announcements.",
  "frontend/src/pages/HomeScreen.tsx": "Home dashboard showing user profile, announcements, module navigation, and admin access.",
  "frontend/src/pages/LoginScreen.tsx": "Login screen allowing users to authenticate via Internet Identity.",
  "frontend/src/pages/modules/FrieslandFungies.tsx": "Placeholder module page with header, navigation back, and informational content.",
  "frontend/src/pages/modules/LandVanOns.tsx": "Placeholder module page for Land van Ons with navigation and basic layout.",
  "frontend/src/pages/modules/Pottle.tsx": "Placeholder module page for Pottle featuring header, navigation, and placeholder text.",
  "frontend/src/router/AppRouter.tsx": "Sets up the root TanStack router with routes for home, module pages, and an admin route protected by AdminGuard.",
  "frontend/src/utils/pendingAccessRequest.ts": "Manages storing, retrieving, and clearing a user's pending access request in localStorage with principal validation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from URL/hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, plugins, colors, animations, and container settings.",
  "project_state.json": "Project state metadata describing app purpose, architecture notes, known issues, and existing feature definitions."
}