{
  "backend/main.mo": "Core backend actor managing user approval, access control, profiles, and request identifiers with persistent state and migration.",
  "backend/migration.mo": "Migration module copying old actor state to the new state without structural changes.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend source files describing components, hooks, pages, and config.",
  "frontend/index.css": "Tailwind base and component layers defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entrypoint mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling identity, approval flow, and routing with pending request cleanup.",
  "frontend/src/components/AdminGuard.tsx": "Protects admin-only routes by checking admin status and redirecting unauthorized users.",
  "frontend/src/hooks/useAccessStatus.ts": "React Query hook fetching approval and admin status from the backend, tied to identity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, approval workflows, and admin actions using an actor API.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AccessPendingScreen.tsx": "UI for submitting and tracking access approval requests with local persistence and error handling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin UI showing pending approvals and approved users with actions to approve, reject, or modify roles.",
  "frontend/src/pages/HomeScreen.tsx": "Main home UI showing modules, logout, announcements, and optional admin access.",
  "frontend/src/pages/LoginScreen.tsx": "Login screen allowing users to authenticate via Internet Identity.",
  "frontend/src/pages/modules/FrieslandFungies.tsx": "Placeholder module page with basic layout and navigation back to home.",
  "frontend/src/pages/modules/LandVanOns.tsx": "React page showing a styled placeholder module screen for Land van Ons with a back button and static text.",
  "frontend/src/pages/modules/Pottle.tsx": "React page displaying a styled placeholder module screen for Pottle with a back button and basic placeholder content.",
  "frontend/src/router/AppRouter.tsx": "Defines the TanStack router setup with routes for home, module pages, and an admin route guarded by AdminGuard.",
  "frontend/src/utils/pendingAccessRequest.ts": "Utility for storing, retrieving, and clearing pending access request data in localStorage tied to a principal.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and containers while enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current features, issues, architectural notes, and versioned state for an employee access app."
}