{
  "backend/main.mo": "Actor managing user approvals, access control, user profiles, and custom modules with admin-only controls and request handling.",
  "backend/user-name.mo": "Defines a simple UserName type containing a name field.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files across the project.",
  "frontend/index.css": "Global Tailwind base styles defining color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point defining root element and loading the main frontend script.",
  "frontend/src/App.tsx": "Root component handling identity initialization and routing between login, pending, and main app states.",
  "frontend/src/components/AdminGuard.tsx": "Route guard that restricts access to admin-only pages and redirects non-admin users.",
  "frontend/src/hooks/useAccessStatus.ts": "Hook that queries backend approval and admin status with refetching behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the current identity with automatic query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, approvals, roles, announcements, and custom modules using an actor backend.",
  "frontend/src/index.css": "Sets Tailwind layers and custom CSS variables for light/dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessPendingScreen.tsx": "Displays and manages pending access requests, including local persistence and approval resubmission.",
  "frontend/src/pages/AdminDashboard.tsx": "Provides admin UI for handling approvals, roles, announcements, and custom modules.",
  "frontend/src/pages/HomeScreen.tsx": "Shows the main user dashboard with profile setup, modules, announcements, and admin entry.",
  "frontend/src/pages/LoginScreen.tsx": "Renders the login screen using Internet Identity authentication.",
  "frontend/src/pages/modules/CustomModulePlaceholder.tsx": "Loads and displays a custom module by ID with fallback UI for missing modules and handles module image URL creation and cleanup.",
  "frontend/src/pages/modules/FrieslandFungies.tsx": "Static placeholder module page with header and basic informational content for Friesland Fungies.",
  "frontend/src/pages/modules/LandVanOns.tsx": "Static placeholder module page providing header and introductory text for Land van Ons.",
  "frontend/src/pages/modules/Pottle.tsx": "Static placeholder module page with header and simple descriptive content for Pottle.",
  "frontend/src/router/AppRouter.tsx": "Defines the application's route tree including static modules, dynamic custom modules, home, and admin routes with a guard.",
  "frontend/src/utils/customModuleImage.ts": "Provides helpers to convert ImageData to object URLs and revoke them to prevent memory leaks.",
  "frontend/src/utils/errorToString.ts": "Converts unknown error values into readable strings by extracting message, status, body, and other fields.",
  "frontend/src/utils/imageCompression.ts": "Implements client-side image compression with scaling and quality adjustment to keep uploads under size limits.",
  "frontend/src/utils/masterAdmin.ts": "Empty file with no implemented functionality.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with extended color tokens, animations, container settings, and typography/container-query/animate plugins.",
  "project_state.json": "Describes the project state focused on fixing camera image upload 413 errors via client-side compression and displaying raw backend errors."
}