{
  "backend/main.mo": "Backend actor implementing access control, approval workflow, user profiles, and admin‑only content management.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining the Android‑inspired OKLCH color system and dark mode variables.",
  "frontend/index.html": "Root HTML file loading the app and bootstrapping the React entrypoint.",
  "frontend/src/App.tsx": "Top‑level app component routing users to login, pending approval, or the main app based on identity and approval status.",
  "frontend/src/components/AdminGuard.tsx": "Guard component restricting routes to admins and redirecting non‑admins with a loading state.",
  "frontend/src/hooks/useAccessStatus.ts": "Hook fetching the caller’s approval and admin status with automatic refetching on mount and focus.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching the backend actor based on identity and invalidating dependent queries when it updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity login, stored identity loading, and login state tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, approvals, and roles using an actor-based backend.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AccessPendingScreen.tsx": "UI for users awaiting approval, allowing name entry, profile saving, and approval requests.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface to review approvals, manage roles, and view user info with profile lookup.",
  "frontend/src/pages/HomeScreen.tsx": "Main user dashboard showing modules, announcements, and optional profile setup.",
  "frontend/src/pages/LoginScreen.tsx": "Login screen that triggers Internet Identity authentication.",
  "frontend/src/pages/modules/FrieslandFungies.tsx": "Placeholder module page with navigation and basic descriptive content.",
  "frontend/src/pages/modules/LandVanOns.tsx": "React module page showing a styled placeholder screen for Land van Ons with a back button and background image.",
  "frontend/src/pages/modules/Pottle.tsx": "React module page displaying a placeholder screen for Pottle with consistent layout, navigation, and styling.",
  "frontend/src/router/AppRouter.tsx": "Defines the app’s route tree using TanStack Router, including home, module pages, and an admin route protected by AdminGuard.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Metadata describing project state, features, requirements, known issues, and architectural notes for the employee app."
}