{
  "backend/main.mo": "Main canister handling user approval, roles, access requests, and profile management with admin authorization checks.",
  "backend/user-name.mo": "Defines a simple UserName type containing a name field.",
  "feature_evidence.json": "Feature evidence report linking a UI layout update to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files.",
  "frontend/index.css": "Global Tailwind-based CSS defining color tokens, theming variables, and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main script.",
  "frontend/src/App.tsx": "Root component choosing between login, pending approval, or main app views based on identity and approval state.",
  "frontend/src/components/AdminGuard.tsx": "Route guard that restricts access to admin-only pages and redirects non-admin users.",
  "frontend/src/hooks/useAccessStatus.ts": "Hook fetching approval and admin status using backend calls with refetch behavior.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the authenticated backend actor and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing login, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, approvals, and roles through the backend actor API.",
  "frontend/src/index.css": "Tailwind CSS config defining light/dark theme variables and base styling.",
  "frontend/src/main.tsx": "App entry that mounts React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/src/pages/AccessPendingScreen.tsx": "UI for submitting and tracking access approval requests, with localStorage persistence and error handling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface displaying pending approvals and user roles with actions to approve, reject, assign roles, and manage users.",
  "frontend/src/pages/HomeScreen.tsx": "Main authenticated home screen showing modules, profile setup flow, announcements, and admin navigation.",
  "frontend/src/pages/LoginScreen.tsx": "Login page allowing users to authenticate via Internet Identity.",
  "frontend/src/pages/modules/FrieslandFungies.tsx": "Placeholder module page with basic layout and navigation back to the home screen.",
  "frontend/src/pages/modules/LandVanOns.tsx": "React page component showing a styled placeholder module screen for Land van Ons with navigation back to home.",
  "frontend/src/pages/modules/Pottle.tsx": "React page component displaying a placeholder module screen for Pottle with consistent styling and a back button.",
  "frontend/src/router/AppRouter.tsx": "Defines the application's route tree using TanStack Router, including home, module pages, and an admin route wrapped with an AdminGuard.",
  "frontend/src/utils/masterAdmin.ts": "Empty utility file reserved for master admin functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, animations, plugins, and container settings.",
  "project_state.json": "Project state describing a mobile UI fix request focused on improving button alignment in the Approved Users section."
}