{
  "backend/main.mo": "Manages user approvals, access control, profiles, notifications, and approval requests with a name-based identifier system.",
  "feature_evidence.json": "Feature evidence report describing a frontend update to replace deprecated requestApproval with requestApprovalWithName.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all major frontend files and their responsibilities.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark mode color tokens and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level app component routing users through login, pending approval, or main app based on identity and approval status.",
  "frontend/src/components/AdminGuard.tsx": "Guard component that restricts access to admin-only routes and redirects non-admin users.",
  "frontend/src/hooks/useAccessStatus.ts": "Hook fetching approval and admin status using React Query with refetch behavior on mount and focus.",
  "frontend/src/hooks/useActor.ts": "Hook creating and refreshing the authenticated backend actor and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity login, stored identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, approvals, and roles via backend actor methods.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessPendingScreen.tsx": "Handles user access request submission, localStorage persistence, and pending state UI.",
  "frontend/src/pages/AdminDashboard.tsx": "Displays pending and approved users, allowing admins to approve, reject, or manage roles.",
  "frontend/src/pages/HomeScreen.tsx": "Shows main user dashboard with module navigation, profile setup, announcements, and admin access.",
  "frontend/src/pages/LoginScreen.tsx": "Renders the login screen and triggers Internet Identity authentication.",
  "frontend/src/pages/modules/FrieslandFungies.tsx": "Placeholder module page with a header and basic informational content.",
  "frontend/src/pages/modules/LandVanOns.tsx": "Placeholder module page with themed header, background, and text, including navigation back to home.",
  "frontend/src/pages/modules/Pottle.tsx": "Placeholder module page for Pottle with header, icon, background, and a back-to-home button.",
  "frontend/src/router/AppRouter.tsx": "Defines the app’s TanStack Router setup, including home, module pages, and an admin route wrapped in an access guard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and clearing parameters from the URL or session.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended color system, animations, plugins, and container settings.",
  "project_state.json": "Project metadata describing features, known issues, and architectural notes related to access control and module pages."
}