{
  "kind": "build_request",
  "title": "Fix access request flow by removing deprecated requestApproval calls and using requestApprovalWithName",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Update the frontend access-request flow so that no UI path calls the deprecated backend method `requestApproval()` (which traps with \"Deprecated: Please use requestApprovalWithName instead\"), and instead all request-access actions call `requestApprovalWithName(name)` with a user-provided name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4",
          "recent-messages-5",
          "recent-messages-6"
        ],
        "quotes": [
          "When trying to request access with a new Internet Identity, it gives error: \"Deprecated: Please use requestApprovalWithName instead\".",
          "Yes, exactly."
        ]
      },
      "acceptanceCriteria": [
        "When signed in with a new (unapproved) Internet Identity and clicking the app's Request Approval action, the frontend calls `actor.requestApprovalWithName(name)` and does not call `actor.requestApproval()` anywhere.",
        "The error message \"Deprecated: Please use requestApprovalWithName instead\" no longer appears during the request-access flow.",
        "If a name is required and missing, the UI prevents submission and clearly prompts for a name (English user-facing text)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Changing the backend API behavior of requestApprovalWithName.",
    "Adding new authentication methods beyond Internet Identity.",
    "Redesigning the Admin Dashboard or approval logic beyond what is needed to eliminate deprecated requestApproval usage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}