{
  "kind": "build_request",
  "title": "Mobile-optimized layout for Approved Users rows (alignment/spacing only)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Admin Dashboard \"Approved Users\" section rows to use a mobile-optimized layout that fixes button alignment/spacing on small screens without changing any button behavior (same actions, same labels, same enabled/disabled logic).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "1. different mobile-optimezed design\n2. Only this section, the rest does look fine.\n3. Only alignment/spacing"
        ]
      },
      "acceptanceCriteria": [
        "Only the \"Approved Users\" section UI is changed; \"Pending Approvals\", reset section, and other pages remain visually/functionally unchanged.",
        "On small/mobile widths, each ApprovedUserRow no longer overflows horizontally and no buttons are clipped off-screen.",
        "On small/mobile widths, the ApprovedUserRow layout is stacked (content area and actions arranged to fit narrow screens) with consistent spacing and alignment (no overlapping elements).",
        "The action buttons in ApprovedUserRow (Make/Remove Admin and Remove) remain fully usable and trigger the same callbacks as before; no new confirmation flows or behavior changes are introduced.",
        "On tablet/desktop widths, the ApprovedUserRow retains an appropriate horizontal layout similar to the current design (no regression).",
        "Implementation is done by editing the ApprovedUserRow markup/classes in frontend/src/pages/AdminDashboard.tsx (responsive Tailwind classes preferred)."
      ]
    }
  ],
  "constraints": [
    "Do not change button behavior or backend logic; alignment/spacing and responsive layout only.",
    "Limit changes to the \"Approved Users\" section; the rest of the app UI should remain as-is.",
    "Do not edit files under frontend/src/components/ui (read-only)."
  ],
  "nonGoals": [
    "Redesigning the entire mobile UI outside the Approved Users section.",
    "Changing role/approval logic, backend APIs, or persistence.",
    "Replacing buttons with icon-only controls or altering button text/actions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}