{
  "kind": "build_request",
  "title": "Treat previously deleted principals as fully new when re-requesting approval",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Backend: Ensure that when a principal that was previously removed/deleted requests approval again, the backend treats them as a completely new requester by clearing all backend records for that principal that could prevent creation of a fresh pending approval request (including any leftover pending/approved/role state and any stored access-request/profile data), and then creates a new pending request that appears in the Admin Dashboard pending approvals list.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Only ensure that any previously deleted principal is treated as fully new (clearing all old records so a fresh pending request is created)."
        ]
      },
      "acceptanceCriteria": [
        "Given a user principal that was previously removed via the existing admin 'remove user' capability, when that same principal logs in and submits a new access request, the call succeeds and returns a new pending request payload (name + 4-character identifier).",
        "After the re-request, admins see a corresponding new entry in Pending Approvals for that principal (with the correct name and 4-character identifier).",
        "The backend does not reuse or preserve any stale pending/approved/admin records for the deleted principal in a way that prevents the new pending request from being created and listed.",
        "This change is limited to re-request behavior for previously deleted principals; it does not add a general-purpose background/orphan cleanup routine."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all actor entrypoints in backend/main.mo (library helpers are fine, but do not introduce additional backend services).",
    "Use English for any user-facing text.",
    "Do not implement broad automatic cleanup of orphan/stale records beyond what is necessary to ensure a previously deleted principal can create a fresh pending request."
  ],
  "nonGoals": [
    "Automatically cleaning up unrelated orphan/stale pending/approved records from older versions for principals that were not explicitly removed/deleted.",
    "Changing the approval-request UI/UX or adding new admin screens beyond what is required for the backend fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}