{
  "kind": "build_request",
  "title": "Backend: Fully clean deleted principals before recreating pending access requests",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Update the Motoko backend `requestApprovalWithName(name)` flow to perform a strict, idempotent cleanup of **all** backend-stored records for the caller principal (pending approval state, approved state, admin/role state, stored profile/name, and any stored access-request/4-char-id metadata) **before** creating a new pending approval request and storing the new `{name, fourCharId}` request record.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "If you want, I can generate a stricter cleanup routine that clears all of them before creating the pending request.",
          "Go for it",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "If a principal was previously removed/deleted and then calls `requestApprovalWithName(name)`, the backend always creates a fresh pending approval entry that appears in the Admin Dashboard pending approvals list.",
        "The cleanup performed by `requestApprovalWithName(name)` removes any existing records for the caller principal across backend state (including approval/pending status, admin/role status, stored profile, and any prior access-request metadata) so that duplicate/leftover state cannot block a new pending request.",
        "Calling `requestApprovalWithName(name)` multiple times for the same unapproved principal results in a single coherent pending request state (no traps due to duplicates; the backend ends in a valid pending state with a returned `{name, fourCharId}`).",
        "Admin principals still cannot request approval; the existing trap/guard behavior remains in place.",
        "No other principals’ approval/profile/role/access-request records are modified by this cleanup routine."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in `backend/main.mo`.",
    "Use English for any user-facing text/messages/trap strings."
  ],
  "nonGoals": [
    "Do not redesign or restyle the frontend UI as part of this change.",
    "Do not add new authentication providers; Internet Identity remains the only auth mechanism.",
    "Do not introduce additional backend services or databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}