{
  "kind": "build_request",
  "title": "Fix Add Custom Module camera image upload (HTTP 413) with automatic client-side compression and raw backend error display",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement automatic client-side image compression for the \"Add Custom Module\" image upload so that camera-captured images are compressed before being sent to the backend, preventing HTTP 413 payload-too-large errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "1. automaticall compress",
          "2. it is part of the add custom module section"
        ]
      },
      "acceptanceCriteria": [
        "When an admin selects an image in the Custom Modules \"Add Module\" form, the app compresses the image before calling the createCustomModule mutation.",
        "The compressed image payload is typically below the canister request limit (~2,097,152 bytes), avoiding the HTTP 413 error shown in the screenshot for common camera photos.",
        "If compression fails for any reason, the module creation flow is aborted and an error is shown to the user (see REQ-2).",
        "The original upload behavior still works for already-small images (i.e., do not unnecessarily degrade small files)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the \"Add Custom Module\" form, display the backend error directly (raw error message/details) when module creation fails (including HTTP status/body text), so the user can use it to diagnose issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Just present one that will help you to resolve, so probably best to show the backend error directly"
        ]
      },
      "acceptanceCriteria": [
        "When the createCustomModule call fails, the UI renders the most informative backend-provided error text available (e.g., includes HTTP status code and response body if present).",
        "If the thrown error is not a standard Error instance, the UI still shows a useful string representation (not blank/undefined).",
        "The error is displayed in the Custom Modules section of the Admin Dashboard without crashing the page."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI component sources).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep backend architecture as a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not increase the backend/canister request size limit to fix the issue (the fix should be client-side compression).",
    "Do not change the CustomModule Motoko type or storage model unless required for the compression fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}