{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Custom Module image upload size errors via client-side compression and improved raw error display",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Compress camera-captured images client-side in the Admin Dashboard “Add Custom Module” flow before sending to backend to avoid HTTP 413 payload-too-large errors.",
      "acceptanceCriteria": [
        "When an admin selects an image in the Custom Modules \"Add Module\" form, the app compresses the image before calling the createCustomModule mutation.",
        "The compressed image payload is typically below the canister request limit (~2,097,152 bytes), avoiding the HTTP 413 error shown in the screenshot for common camera photos.",
        "If compression fails for any reason, the module creation flow is aborted and an error is shown to the user (see REQ-2).",
        "The original upload behavior still works for already-small images (i.e., do not unnecessarily degrade small files)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/imageCompression.ts",
          "operation": "create",
          "description": "Add a reusable client-side image compression utility that can take a File/Blob, optionally downscale, and iteratively adjust encoding quality (e.g., JPEG/WebP) to meet a target byte-size threshold suitable for canister request limits; return compressed bytes plus resulting contentType, and throw a descriptive error when compression is not possible."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Update the Custom Modules “Add Module” form submission to compress the selected image (using the new imageCompression utility) before building the CustomModule payload; keep original bytes for already-small images, and abort module creation (surfacing the compression error) if compression fails."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show the most informative raw backend error details in the Admin Dashboard Custom Modules “Add Custom Module” form when createCustomModule fails.",
      "acceptanceCriteria": [
        "When the createCustomModule call fails, the UI renders the most informative backend-provided error text available (e.g., includes HTTP status code and response body if present).",
        "If the thrown error is not a standard Error instance, the UI still shows a useful string representation (not blank/undefined).",
        "The error is displayed in the Custom Modules section of the Admin Dashboard without crashing the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/errorToString.ts",
          "operation": "create",
          "description": "Add a robust error-to-string formatter that extracts meaningful details from unknown thrown values (Error instances, strings, objects), preferring rich fields when present (e.g., status/response/body/message), and safely stringifying nested details without throwing."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Replace the current module creation error handling (error.message fallback) with the new errorToString utility and render the resulting raw error text in the Custom Modules section (e.g., in a readable/preformatted block) so HTTP status/body details are visible without crashing the page; also use the same formatter for compression failures from REQ-1."
        }
      ]
    }
  ]
}