{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Application with an \"Add Custom Module\" section where users can upload images via camera; currently hitting a 413 upload-limit error that needs a client-side compression fix.",
  "architectural_notes": [
    "Implement automatic client-side compression for camera-captured images before upload in the Add Custom Module flow.",
    "On upload failure after compression, display the backend error message directly to the user."
  ],
  "known_issues": [
    "Camera-based image upload in Add Custom Module can fail with HTTP 413 (payload too large) due to upload size limits."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-implement-automatic-client-side-image-compression-for-the-add-custom-module-image-upload-so-that-camera-captured-images-are-compressed-before-being-sent-to-the-backend-preventing-http-413-payload-too-large-errors",
      "title": "Implement automatic client-side image compression for the \"Add Custom Module\" image upload so that camera-captured images are compressed before being sent to the backend, preventing HTTP 413 payload-too-large errors.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-in-the-add-custom-module-form-display-the-backend-error-directly-raw-error-message-details-when-module-creation-fails-including-http-status-body-text-so-the-user-can-use-it-to-diagnose-issues",
      "title": "In the \"Add Custom Module\" form, display the backend error directly (raw error message/details) when module creation fails (including HTTP status/body text), so the user can use it to diagnose issues.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix camera image upload 413 in Add Custom Module by automatically compressing camera images client-side and surface backend error message on failure.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Fix Add Custom Module camera image upload (HTTP 413) with automatic client-side compression and raw backend error display",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}